// 课件url前置（很重要）
export const COURSE_URL = '/ac022';
// prettier-ignore
export const COURSE_PAGE = [
    1, 2, 3, 2,                                                 // 1页 ~ 4页
    4, 4, 5, 5, 4, 4, 5, 5, 4, 4, 5, 5, 7, 8, 8, 8, 8, 8, 8,    // 5页 ~ 23页
    4, 4, 5, 5, 4, 4, 5, 5, 4, 4, 5, 5, 7, 8, 8, 8, 8, 8, 8,    // 24页 ~ 42页
    4, 4, 5, 5, 4, 4, 5, 5, 4, 4, 5, 5, 7, 8, 8, 8, 8, 8, 8,    // 43页 ~ 61页
    3, 3,
    { page: 6, rangeIndex: [64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83] },
    { page: 3, rangeIndex: [84] },
    { page: 9, rangeIndex: [85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104] },
    { page: 3, rangeIndex: [105] },
    { page: 10, rangeIndex: [106, 107, 108, 109, 110, 111, 112, 113, 114] },
    { page: 3, rangeIndex: [115] },
];
// 课件页数
export const COURSE_PAGE_COUNT = 115;